In [1]:
from sqlalchemy import create_engine
import pandas as pd

# Create SQLAlchemy engine
engine = create_engine("mysql+mysqlconnector://username:password@host/retail_sales?charset=utf8mb4")

# Load the 6 tables
df_transactions = pd.read_sql("SELECT * FROM transactions", con=engine)
df_products = pd.read_sql("SELECT * FROM products", con=engine)
df_customers = pd.read_sql("SELECT * FROM customers", con=engine)
df_employees = pd.read_sql("SELECT * FROM employees", con=engine)
df_stores = pd.read_sql("SELECT * FROM stores", con=engine)
df_discounts = pd.read_sql("SELECT * FROM discounts", con=engine)

A. Basic Overview (for each df_*)

In [2]:
# Basic inspection
df_transactions.info()
display(df_transactions.head())
display(df_transactions.describe(include='all'))

# Summary of datetime columns
date_cols = df_transactions.select_dtypes(include='datetime')
if not date_cols.empty:
    print("\nDatetime column stats:")
    display(date_cols.agg(['min', 'max']))

# Check for fully duplicated rows
duplicates = df_transactions.duplicated()
print(f"Total fully duplicated rows: {duplicates.sum()}")

# Drop them if any
df_transactions = df_transactions[~duplicates]

# Check missing values per column
print("\nMissing values per column:")
print(df_transactions.isnull().sum().sort_values(ascending=False))

# Handling missing values
# 'color' and 'size' missing values fill with "Unknown"
df_transactions['color'] = df_transactions['color'].fillna('Unknown')
df_transactions['size'] = df_transactions['size'].fillna('Unknown')

# Fill missing values with "Unknown" for 'sku' too
df_transactions['sku'] = df_transactions['sku'].fillna('Unknown')

# Check for unrealistic values
print("\nChecking for negative quantities:")
print(df_transactions[df_transactions['quantity'] < 0])  # Should be empty

print("\nChecking for negative unit prices:")
print(df_transactions[df_transactions['unit_price'] < 0])  # Should be empty

# Check for large discounts
print("\nDiscount range:")
print(df_transactions['discount'].describe())

# Make sure discount is between 0 and 1
df_transactions = df_transactions[(df_transactions['discount'] >= 0) & (df_transactions['discount'] <= 1)]

# Ensure data types
# already handled well but in case any issues exist
df_transactions['date'] = pd.to_datetime(df_transactions['date'], errors='coerce')

# Final quick check
print("\nCleaned Data Summary:")
print(df_transactions.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6416827 entries, 0 to 6416826
Data columns (total 19 columns):
 #   Column            Dtype
---  ------            -----
 0   invoice_id        object
 1   line              int64
 2   customer_id       int64
 3   product_id        int64
 4   size              object
 5   color             object
 6   unit_price        float64
 7   quantity          int64
 8   date              datetime64[ns]
 9   discount          float64
 10  line_total        float64
 11  store_id          int64
 12  employee_id       int64
 13  currency          object
 14  currency_symbol   object
 15  sku               object
 16  transaction_type  object
 17  payment_method    object
 18  invoice_total     float64
dtypes: datetime64[ns](1), float64(4), int64(6), object(8)
memory usage: 930.2+ MB

,invoice_id,line,customer_id,product_id,size,color,unit_price,quantity,date,discount,line_total,store_id,employee_id,currency,currency_symbol,sku,transaction_type,payment_method,invoice_total
0,INV-US-001-03558761,1,47162,485,M,None,80.5,1,2023-01-01 15:42:00,0.0,80.5,1,7,USD,$,MASU485-M-,Sale,Cash,126.7
1,INV-US-001-03558761,2,47162,2779,G,None,31.5,1,2023-01-01 15:42:00,0.4,18.9,1,7,USD,$,CHCO2779-G-,Sale,Cash,126.7
2,INV-US-001-03558761,3,47162,64,M,NEUTRAL,45.5,1,2023-01-01 15:42:00,0.4,27.3,1,7,USD,$,MACO64-M-NEUTRAL,Sale,Cash,126.7
3,INV-US-001-03558762,1,10142,131,M,BLUE,70.0,1,2023-01-01 20:04:00,0.4,42.0,1,6,USD,$,FECO131-M-BLUE,Sale,Cash,77.0
4,INV-US-001-03558762,2,10142,716,L,WHITE,26.0,1,2023-01-01 20:04:00,0.0,26.0,1,6,USD,$,MAT-716-L-WHITE,Sale,Cash,77.0

,invoice_id,line,customer_id,product_id,size,color,unit_price,quantity,date,discount,line_total,store_id,employee_id,currency,currency_symbol,sku,transaction_type,payment_method,invoice_total
count,6416827,6.416827e+06,6.416827e+06,6.416827e+06,6003725,2066044,6.416827e+06,6.416827e+06,6416827,6.416827e+06,6.416827e+06,6.416827e+06,6.416827e+06,6416827,6416827,6416827,6416827,6416827,6.416827e+06
unique,4540404,NaN,NaN,NaN,15,15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,4,63891,2,2,NaN
top,RET-US-003-03885318,NaN,NaN,NaN,M,BLUE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,EUR,‚Ç¨,MAPA13328-38-BLUE,Sale,Credit Card,NaN
freq,28,NaN,NaN,NaN,2621064,170526,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2549397,2549397,672,6077200,5135298,NaN
mean,NaN,1.580262e+00,7.326331e+05,9.263666e+03,NaN,NaN,1.324640e+02,1.100243e+00,2024-03-12 17:01:12.023905280,1.190578e-01,1.141912e+02,1.345978e+01,1.562327e+02,NaN,NaN,NaN,NaN,NaN,2.435266e+02
min,NaN,1.000000e+00,1.000000e+00,1.000000e+00,NaN,NaN,2.000000e+00,1.000000e+00,2023-01-01 00:00:00,0.000000e+00,-3.348000e+03,1.000000e+00,5.000000e+00,NaN,NaN,NaN,NaN,NaN,-6.750500e+03
25%,NaN,1.000000e+00,2.945170e+05,6.385000e+03,NaN,NaN,3.250000e+01,1.000000e+00,2023-09-22 13:12:30,0.000000e+00,2.475000e+01,5.000000e+00,5.800000e+01,NaN,NaN,NaN,NaN,NaN,3.402000e+01
50%,NaN,1.000000e+00,6.765210e+05,9.156000e+03,NaN,NaN,5.100000e+01,1.000000e+00,2024-03-10 19:52:00,0.000000e+00,4.350000e+01,1.000000e+01,1.220000e+02,NaN,NaN,NaN,NaN,NaN,8.350000e+01
75%,NaN,2.000000e+00,1.138852e+06,1.267900e+04,NaN,NaN,1.165000e+02,1.000000e+00,2024-10-08 15:15:00,2.500000e-01,1.090000e+02,2.200000e+01,2.530000e+02,NaN,NaN,NaN,NaN,NaN,2.410000e+02
max,NaN,7.000000e+00,1.643306e+06,1.794000e+04,NaN,NaN,1.153500e+03,3.000000e+00,2025-03-18 20:59:00,6.000000e-01,3.460500e+03,3.500000e+01,4.040000e+02,NaN,NaN,NaN,NaN,NaN,8.977000e+03
std,NaN,1.151730e+00,4.874764e+05,3.856838e+03,NaN,NaN,1.850971e+02,3.963792e-01,NaN,1.990280e-01,2.115865e+02,1.013435e+01,1.171475e+02,NaN,NaN,NaN,NaN,NaN,5.367338e+02

Datetime column stats:

                   date
min 2023-01-01 00:00:00
max 2025-03-18 20:59:00

Total fully duplicated rows: 798

Missing values per column:
color               4350231
size                 413049
invoice_id                0
customer_id               0
line                      0
product_id                0
unit_price                0
quantity                  0
date                      0
discount                  0
line_total                0
store_id                  0
employee_id               0
currency                  0
currency_symbol           0
sku                       0
transaction_type          0
payment_method            0
invoice_total             0
dtype: int64

Checking for negative quantities:
Empty DataFrame
Columns: [invoice_id, line, customer_id, product_id, size, color, unit_price, quantity, date, discount, line_total, store_id, employee_id, currency, currency_symbol, sku, transaction_type, payment_method, invoice_total]
Index: []

Checking for negative unit prices:
Empty DataFrame
Columns: [invoice_id, line, customer_id, product_id, size, color, unit_price, quantity, date, discount, line_total, store_id, employee_id, currency, currency_symbol, sku, transaction_type, payment_method, invoice_total]
Index: []

Discount range:
count    6.416029e+06
mean     1.190726e-01
std      1.990359e-01
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      2.500000e-01
max      6.000000e-01
Name: discount, dtype: float64

Cleaned Data Summary:
<class 'pandas.core.frame.DataFrame'>
Index: 6416029 entries, 0 to 6416826
Data columns (total 19 columns):
 #   Column            Dtype
---  ------            -----
 0   invoice_id        object
 1   line              int64
 2   customer_id       int64
 3   product_id        int64
 4   size              object
 5   color             object
 6   unit_price        float64
 7   quantity          int64
 8   date              datetime64[ns]
 9   discount          float64
 10  line_total        float64
 11  store_id          int64
 12  employee_id       int64
 13  currency          object
 14  currency_symbol   object
 15  sku               object
 16  transaction_type  object
 17  payment_method    object
 18  invoice_total     float64
dtypes: datetime64[ns](1), float64(4), int64(6), object(8)
memory usage: 979.0+ MB
None

In [3]:
# Upload to MySQL with progress bar
from tqdm import tqdm

def upload_to_mysql(df, table_name, engine):
    total_rows = len(df)
    chunksize = 20000
    num_chunks = (total_rows // chunksize) + 1

    with tqdm(total=num_chunks, desc=f"üì¶ Uploading {table_name}") as pbar:
        for i in range(num_chunks):
            chunk = df.iloc[i * chunksize : (i + 1) * chunksize]
            chunk.to_sql(
                name=table_name,
                con=engine,
                if_exists='append' if i > 0 else 'replace',
                index=False,
                method='multi'
            )
            pbar.update(1)

    print(f"\n‚úÖ '{table_name}' uploaded to MySQL successfully.")

In [4]:
upload_to_mysql(df_transactions, 'transactions_cleaned', engine)

üì¶ Uploading transactions_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 321/321 [27:18<00:00,  5.11s/it]

‚úÖ 'transactions_cleaned' uploaded to MySQL successfully.

In [5]:
# Basic inspection
df_products.info()
display(df_products.head())
display(df_products.describe(include='all'))

# Drop fully duplicated rows
df_products = df_products.drop_duplicates()

# Clean 'color' column (replace 'nan' string with 'Unknown')
df_products['color'] = df_products['color'].replace('nan', 'Unknown')

# Ensure no negative production costs
print("\nNegative production cost values:")
print(df_products[df_products['production_cost'] < 0])  # Should be empty
df_products = df_products[df_products['production_cost'] >= 0]

# Final schema check
print("\n‚úÖ Cleaned products.csv summary:")
print(df_products.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17940 entries, 0 to 17939
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   product_id       17940 non-null  int64
 1   category         17940 non-null  object
 2   sub_category     17940 non-null  object
 3   description_pt   17940 non-null  object
 4   description_de   17940 non-null  object
 5   description_fr   17940 non-null  object
 6   description_es   17940 non-null  object
 7   description_en   17940 non-null  object
 8   description_zh   17940 non-null  object
 9   color            17940 non-null  object
 10  sizes            17940 non-null  object
 11  production_cost  17940 non-null  float64
dtypes: float64(1), int64(1), object(10)
memory usage: 1.6+ MB

,product_id,category,sub_category,description_pt,description_de,description_fr,description_es,description_en,description_zh,color,sizes,production_cost
0,1,Feminine,Coats and Blazers,Esportivo Veludo Verde Com Bot√µes,Sport Samt Sport Mit Kn√∂pfen,Sports Velvet Sports Avec Des Boutons,Deportes De Terciopelo Con Botones,Sports Velvet Sports With Buttons,ËøêÂä®Â§©ÈπÖÁªíËøêÂä®‰∏éÊåâÈíÆ,nan,S|M|L|XL,10.73
1,2,Feminine,Sweaters and Knitwear,Luxuoso Denim Rosa Com Bot√µes,Luxuri√∂ser Rosa Jeans Mit Kn√∂pfen,L√©chard De Denim Rose Avec Boutons,Denim Rosa Lujoso Con Botones,Luxurious Pink Denim With Buttons,Ë±™ÂçéÁöÑÁ≤âÁ∫¢Ëâ≤Áâõ‰ªîÂ∏ÉÂíåÁ∫ΩÊâ£,PINK,S|M|L|XL,19.55
2,3,Feminine,Dresses and Jumpsuits,Retr√¥ Tricot Preto Estampado,Black Tricot Gedruckter Tricot,Tricot Imprim√© En Tricot Noir,Tricot Negro Tricot Impreso,Black Tricot Printed Tricot,ÈªëËâ≤‰∏âËßíÂΩ¢Âç∞Âà∑‰∏âËßíÂΩ¢,BLACK,S|M|L|XL,25.59
3,4,Feminine,Shirts and Blouses,Blusa De Algod√£o B√°sica,Basis -Baumwollbluse,Chemisier En Coton De Base,Blusa De Algod√≥n,Basic Cotton Blouse,Âü∫Êú¨ÁöÑÊ£âË°¨Ë°´,nan,S|M|L|XL,27.62
4,5,Feminine,T-shirts and Tops,T-Shirt B√°sica De Algod√£o,Basis-Baumwoll-T-Shirt,T-Shirt En Coton De Base,Camiseta B√°sica De Algod√≥n,Basic Cotton T-Shirt,Âü∫Êú¨Ê£âTÊÅ§,nan,S|M|L,11.69

,product_id,category,sub_category,description_pt,description_de,description_fr,description_es,description_en,description_zh,color,sizes,production_cost
count,17940.00000,17940,17940,17940,17940,17940,17940,17940,17940,17940,17940,17940.000000
unique,NaN,3,21,9296,9198,9202,9242,9223,9143,16,13,NaN
top,NaN,Feminine,Accessories,Conjunto De Blusa De Tricot E Saia De Veludo,M√§nnliche Fakt,Cap,Tricot Bluse Set Y Skirda De Velvet,Tricot Blouse Set And Velvet Skirt,Ê≥¢Ë•øÁ±≥‰∫öÈ£é,nan,S|M|L|XL,NaN
freq,NaN,7590,2070,10,43,44,15,15,21,12445,5572,NaN
mean,8970.50000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,16.096189
std,5178.97625,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,11.628072
min,1.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.560000
25%,4485.75000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.800000
50%,8970.50000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.135000
75%,13455.25000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20.970000
max,17940.00000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,77.190000

Negative production cost values:
Empty DataFrame
Columns: [product_id, category, sub_category, description_pt, description_de, description_fr, description_es, description_en, description_zh, color, sizes, production_cost]
Index: []

‚úÖ Cleaned products.csv summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17940 entries, 0 to 17939
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   product_id       17940 non-null  int64
 1   category         17940 non-null  object
 2   sub_category     17940 non-null  object
 3   description_pt   17940 non-null  object
 4   description_de   17940 non-null  object
 5   description_fr   17940 non-null  object
 6   description_es   17940 non-null  object
 7   description_en   17940 non-null  object
 8   description_zh   17940 non-null  object
 9   color            17940 non-null  object
 10  sizes            17940 non-null  object
 11  production_cost  17940 non-null  float64
dtypes: float64(1), int64(1), object(10)
memory usage: 1.6+ MB
None

In [6]:
upload_to_mysql(df_products, 'products_cleaned', engine)

üì¶ Uploading products_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 1/1 [00:02<00:00,  2.64s/it]

‚úÖ 'products_cleaned' uploaded to MySQL successfully.

In [7]:
# Initial Inspection
df_customers.info()
display(df_customers.head())
display(df_customers.describe(include='all'))

# Drop fully duplicated rows
df_customers = df_customers.drop_duplicates()

# Fix 'nan' string in job_titles
df_customers['job_titles'] = df_customers['job_titles'].replace('nan', 'Unknown')

# Convert 'date_of_birth' to datetime
df_customers['date_of_birth'] = pd.to_datetime(df_customers['date_of_birth'], errors='coerce')

# Normalize 'gender' values
df_customers['gender'] = df_customers['gender'].apply(lambda x: x if x in ['M', 'F'] else 'O')

# Final check
print("\n‚úÖ Cleaned customers.csv summary:")
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1643306 entries, 0 to 1643305
Data columns (total 9 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   customer_id    1643306 non-null  int64
 1   name           1643306 non-null  object
 2   email          1643306 non-null  object
 3   telephone      1643306 non-null  object
 4   city           1643306 non-null  object
 5   country        1643306 non-null  object
 6   gender         1643306 non-null  object
 7   date_of_birth  1643306 non-null  object
 8   job_titles     1643306 non-null  object
dtypes: int64(1), object(8)
memory usage: 112.8+ MB

,customer_id,name,email,telephone,city,country,gender,date_of_birth,job_titles
0,1,Tyler Garcia,tyler.garcia@fake_gmail.com,922.970.2265x47563,New York,United States,M,2003-07-15,nan
1,2,Joshua Miller,joshua.miller@fake_gmail.com,+1-958-729-6169,New York,United States,M,2000-06-16,Records manager
2,3,Alison Marshall DDS,alison.marshall.dds@fake_hotmail.com,+1-645-567-0876x5409,New York,United States,F,2003-07-22,nan
3,4,Jeffery Acosta,jeffery.acosta@fake_yahoo.com,212.336.0912x84994,New York,United States,M,1996-11-12,Proofreader
4,5,Ashley Sanders,ashley.sanders@fake_hotmail.com,7814535781,New York,United States,F,1998-02-10,Exercise physiologist

,customer_id,name,email,telephone,city,country,gender,date_of_birth,job_titles
count,1.643306e+06,1643306,1643306,1643306,1643306,1643306,1643306,1643306,1643306
unique,NaN,883870,1112164,1643198,763,7,3,20909,640
top,NaN,Michael Smith,michael.smith@fake_hotmail.com,18224980430,Ê∑±Âú≥,United States,M,2006-03-20,nan
freq,NaN,342,123,2,60709,354450,964562,600,584185
mean,8.216535e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,4.743817e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,1.000000e+00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,4.108272e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,8.216535e+05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.232480e+06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.643306e+06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

‚úÖ Cleaned customers.csv summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1643306 entries, 0 to 1643305
Data columns (total 9 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   customer_id    1643306 non-null  int64
 1   name           1643306 non-null  object
 2   email          1643306 non-null  object
 3   telephone      1643306 non-null  object
 4   city           1643306 non-null  object
 5   country        1643306 non-null  object
 6   gender         1643306 non-null  object
 7   date_of_birth  1643306 non-null  datetime64[ns]
 8   job_titles     1643306 non-null  object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 112.8+ MB

In [8]:
upload_to_mysql(df_customers, 'customers_cleaned', engine)

üì¶ Uploading customers_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 83/83 [02:51<00:00,  2.07s/it]

‚úÖ 'customers_cleaned' uploaded to MySQL successfully.

In [9]:
# Initial inspection
df_employees.info()
display(df_employees.head())
display(df_employees.describe(include='all'))

# Drop exact duplicate rows
df_employees = df_employees.drop_duplicates()

# Normalize column names
df_employees.columns = df_employees.columns.str.strip().str.lower()

# Validate store_id and employee_id types
df_employees['employee_id'] = df_employees['employee_id'].astype(int)
df_employees['store_id'] = df_employees['store_id'].astype(int)

# Final check
print("\n‚úÖ Cleaned employees.csv summary:")
df_employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 404 entries, 0 to 403
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  404 non-null    int64
 1   store_id     404 non-null    int64
 2   name         404 non-null    object
 3   position     404 non-null    object
dtypes: int64(2), object(2)
memory usage: 12.8+ KB

   employee_id  store_id                name           position
0            1         1     Stephen Johnson      Store Manager
1            2         1       Rebecca Myers  Assistant Manager
2            3         1  Katherine Buchanan            Cashier
3            4         1       Jessica Hicks        Stock Clerk
4            5         1          Ryan Gross    Sales Associate

        employee_id    store_id name         position
count    404.000000  404.000000  404              404
unique          NaN         NaN  401                5
top             NaN         NaN   ÂàòÂÆÅ  Sales Associate
freq            NaN         NaN    3              264
mean     202.500000   17.608911  NaN              NaN
std      116.769003   10.184429  NaN              NaN
min        1.000000    1.000000  NaN              NaN
25%      101.750000    9.000000  NaN              NaN
50%      202.500000   17.000000  NaN              NaN
75%      303.250000   27.000000  NaN              NaN
max      404.000000   35.000000  NaN              NaN

‚úÖ Cleaned employees.csv summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 404 entries, 0 to 403
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  404 non-null    int64
 1   store_id     404 non-null    int64
 2   name         404 non-null    object
 3   position     404 non-null    object
dtypes: int64(2), object(2)
memory usage: 12.8+ KB

In [10]:
upload_to_mysql(df_employees, 'employees_cleaned', engine)

üì¶ Uploading employees_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 1/1 [00:00<00:00, 10.55it/s]

‚úÖ 'employees_cleaned' uploaded to MySQL successfully.

In [11]:
# Initial inspection
df_stores.info()
display(df_stores.head())
display(df_stores.describe(include='all'))

# Drop duplicate rows
df_stores = df_stores.drop_duplicates()

# Standardize column names
df_stores.columns = df_stores.columns.str.strip().str.lower()

# Clean ZIP codes (if needed)
df_stores['zip_code'] = df_stores['zip_code'].astype(str).str.strip()

# Final check
print("\n‚úÖ Cleaned stores.csv summary:")
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   store_id             35 non-null     int64
 1   country              35 non-null     object
 2   city                 35 non-null     object
 3   store_name           35 non-null     object
 4   number_of_employees  35 non-null     int64
 5   zip_code             35 non-null     object
 6   latitude             35 non-null     float64
 7   longitude            35 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 2.3+ KB

,store_id,country,city,store_name,number_of_employees,zip_code,latitude,longitude
0,1,United States,New York,Store New York,10,10001,40.7128,-74.0060
1,2,United States,Los Angeles,Store Los Angeles,8,90001,34.0522,-118.2437
2,3,United States,Chicago,Store Chicago,9,60601,41.8781,-87.6298
3,4,United States,Houston,Store Houston,10,77001,29.7604,-95.3698
4,5,United States,Phoenix,Store Phoenix,9,85001,33.4484,-112.0740

,store_id,country,city,store_name,number_of_employees,zip_code,latitude,longitude
count,35.000000,35,35,35,35.000000,35,35.000000,35.000000
unique,NaN,7,35,35,NaN,35,NaN,NaN
top,NaN,United States,New York,Store New York,NaN,10001,NaN,NaN
freq,NaN,5,1,1,NaN,1,NaN,NaN
mean,18.000000,NaN,NaN,NaN,8.542857,NaN,42.137520,2.650294
std,10.246951,NaN,NaN,NaN,1.120474,NaN,8.489386,58.197368
min,1.000000,NaN,NaN,NaN,7.000000,NaN,22.542900,-118.243700
25%,9.500000,NaN,NaN,NaN,7.500000,NaN,39.093000,-8.357900
50%,18.000000,NaN,NaN,NaN,9.000000,NaN,41.550300,-0.376600
75%,26.500000,NaN,NaN,NaN,9.000000,NaN,49.490050,7.973450
max,35.000000,NaN,NaN,NaN,10.000000,NaN,55.858000,121.473700

‚úÖ Cleaned stores.csv summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   store_id             35 non-null     int64
 1   country              35 non-null     object
 2   city                 35 non-null     object
 3   store_name           35 non-null     object
 4   number_of_employees  35 non-null     int64
 5   zip_code             35 non-null     object
 6   latitude             35 non-null     float64
 7   longitude            35 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 2.3+ KB

In [12]:
upload_to_mysql(df_stores, 'stores_cleaned', engine)

üì¶ Uploading stores_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 1/1 [00:00<00:00, 17.33it/s]

‚úÖ 'stores_cleaned' uploaded to MySQL successfully.

In [13]:
# Initial inspection
df_discounts.info()
display(df_discounts.head())
display(df_discounts.describe(include='all'))

# Drop duplicates
df_discounts = df_discounts.drop_duplicates()

# Convert 'start' and 'end' to datetime
df_discounts['start'] = pd.to_datetime(df_discounts['start'], errors='coerce')
df_discounts['end'] = pd.to_datetime(df_discounts['end'], errors='coerce')

# Check discount bounds
df_discounts = df_discounts[(df_discounts['discount'] >= 0) & (df_discounts['discount'] <= 1)]

# Final check
print("\n‚úÖ Cleaned discounts.csv summary:")
df_discounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   start         181 non-null    object
 1   end           181 non-null    object
 2   discount      181 non-null    float64
 3   description   181 non-null    object
 4   category      181 non-null    object
 5   sub_category  181 non-null    object
dtypes: float64(1), object(5)
memory usage: 8.6+ KB

,start,end,discount,description,category,sub_category
0,2020-01-01,2020-01-10,0.4,40% discount during our New Year Winter Sale,Feminine,Coats and Blazers
1,2020-01-01,2020-01-10,0.4,40% discount during our New Year Winter Sale,Feminine,Sweaters and Knitwear
2,2020-01-01,2020-01-10,0.4,40% discount during our New Year Winter Sale,Masculine,Coats and Blazers
3,2020-01-01,2020-01-10,0.4,40% discount during our New Year Winter Sale,Masculine,Sweaters and Sweatshirts
4,2020-01-01,2020-01-10,0.4,40% discount during our New Year Winter Sale,Children,Coats

,start,end,discount,description,category,sub_category
count,181,181,181.000000,181,181,181
unique,37,37,NaN,7,4,17
top,2020-05-01,2020-05-15,NaN,25% discount during our Mid-Spring Refresh Sale,Feminine,Dresses and Jumpsuits
freq,8,8,NaN,40,64,16
mean,NaN,NaN,0.343370,NaN,NaN,NaN
std,NaN,NaN,0.103603,NaN,NaN,NaN
min,NaN,NaN,0.200000,NaN,NaN,NaN
25%,NaN,NaN,0.250000,NaN,NaN,NaN
50%,NaN,NaN,0.350000,NaN,NaN,NaN
75%,NaN,NaN,0.400000,NaN,NaN,NaN
max,NaN,NaN,0.600000,NaN,NaN,NaN

‚úÖ Cleaned discounts.csv summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   start         181 non-null    datetime64[ns]
 1   end           181 non-null    datetime64[ns]
 2   discount      181 non-null    float64
 3   description   181 non-null    object
 4   category      181 non-null    object
 5   sub_category  181 non-null    object
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 8.6+ KB

In [14]:
upload_to_mysql(df_discounts, 'discounts_cleaned', engine)

üì¶ Uploading discounts_cleaned: 100%|‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà| 1/1 [00:00<00:00, 12.94it/s]

‚úÖ 'discounts_cleaned' uploaded to MySQL successfully.